[Killed] LogicalOperator
src/main/components/OurTable.js:35:13
       {
         columns,
         data,
-        ...(rest.initialState && {
-          initialState: rest.initialState,
-        }),
+        ...(rest.initialState || {
+  initialState: rest.initialState
+}),
       },
       useSortBy
killedBy: PagedJobsTable tests renders correct content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  🔽
Received:

[Survived] StringLiteral
src/main/components/OurTable.js:47:22
       <Table style={tableStyle} {...getTableProps()} striped bordered hover>
         <thead
           style={{
-            display: "table",
+            display: "",
             width: "100%",
             tableLayout: "fixed",

[Survived] StringLiteral
src/main/components/OurTable.js:49:26
           style={{
             display: "table",
             width: "100%",
-            tableLayout: "fixed",
+            tableLayout: "",
           }}
         >

[Killed] ArrowFunction
src/main/components/OurTable.js:52:29
             tableLayout: "fixed",
           }}
         >
-          {headerGroups.map((headerGroup) => (
-            <tr {...headerGroup.getHeaderGroupProps()}>
-              {headerGroup.headers.map((column) => (
-                <th
-                  {...column.getHeaderProps(column.getSortByToggleProps())}
-                  data-testid={`${testid}-header-${column.id}`}
-                >
-                  {column.render("Header")}
-                  <span
-                    data-testid={`${testid}-header-${column.id}-sort-carets`}
-                  >
-                    {column.isSorted
-                      ? column.isSortedDesc
-                        ? " 🔽"
-                        : " 🔼"
-                      : ""}
-                  </span>
-                </th>
-              ))}
-            </tr>
-          ))}
+          {headerGroups.map(() => undefined)}
         </thead>
         <tbody
killedBy: OurTable tests default testid is testId
statusReason: Error: Unable to find an element by: [data-testid="testid-header-col1"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Survived] ObjectLiteral
src/main/components/OurTable.js:76:18
         </thead>
         <tbody
           {...getTableBodyProps()}
-          style={{
-            display: "table",
-            width: "100%",
-            tableLayout: "fixed",
-          }}
+          style={{}}
         >
           {rows

[Killed] MethodExpression
src/main/components/OurTable.js:82:12
             tableLayout: "fixed",
           }}
         >
-          {rows
-            .slice(pageIndex * pageSize, (pageIndex + 1) * pageSize)
+          {rows
             .map((row) => {
               prepareRow(row);
killedBy: OurTable tests renders a table with 30 rows and clicks on the next page button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/main/components/OurTable.js:111:14
               data-testid={`${testid}-prev-page-button`}
               disabled={pageIndex === 0}
             />
-            {pageIndex > 3 && (
+            {pageIndex >= 3 && (
               <Pagination.Item
                 onClick={() => setPageIndex(0)}
killedBy: OurTable tests renders a table with 100 rows and tests the first page button visibility
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/main/components/OurTable.js:138:14
                 {pageIndex - 1}
               </Pagination.Item>
             )}
-            {pageIndex > 0 && (
-              <Pagination.Item
-                onClick={() => setPageIndex(pageIndex - 1)}
-                data-testid={`${testid}-back-one-page-button`}
-              >
-                {pageIndex}
-              </Pagination.Item>
-            )}
+            {true}
             <Pagination.Item
               data-testid={`${testid}-current-page-button`}
killedBy: OurTable tests renders a table with 100 rows and tests the last page button
statusReason: Error: Unable to find an element by: [data-testid="testid-back-one-page-button"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] ConditionalExpression
src/main/components/OurTable.js:138:14
                 {pageIndex - 1}
               </Pagination.Item>
             )}
-            {pageIndex > 0 && (
+            {true && (
               <Pagination.Item
                 onClick={() => setPageIndex(pageIndex - 1)}
killedBy: OurTable tests renders a table with 100 rows and tests the first page
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
