[Survived] LogicalOperator
main/components/Nav/AppNavbar.js:47:15
 
           <Nav className="me-auto">
             {
-              (hasRole(currentUser, "ROLE_USER")) && (
-                <>
-                  <Nav.Link href="/courses">Courses</Nav.Link>
-                </>
-              )
+              hasRole(currentUser, "ROLE_USER") || <>
+                  <Nav.Link href="/courses">Courses</Nav.Link>
+                </>
             }
           </Nav>
