[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.js:10:48
 
 // should take in a players list from a commons
 export default function LeaderboardTable({ leaderboardUsers }) {
-    const USD = new Intl.NumberFormat("en-US", {
-        style: "currency",
-        currency: "USD",
-    });
+    const USD = new Intl.NumberFormat("en-US", {});
 
     const columns = [
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $1,000.00
Received:
  1,000

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.js:35:21
             },
         },
         {
-            Header: "Cows Owned",
+            Header: "",
             accessor: "numOfCows",
             Cell: (props) => {
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Cows Owned. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      role="table"
    >
      <table
