[Killed] StringLiteral
main/components/Commons/PagedProfitsTable.js:11:20
 
 const PagedProfitsTable = () => {
 
-    const testId = "PagedProfitsTable";
+    const testId = "";
     const refreshJobsIntervalMilliseconds = 5000;
 
killedBy: PagedProfitsTable tests renders correct content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PagedProfitsTable-next-button"]

<body>
  <div>
    <p>
      Page: 
      1
    </p>

[Killed] ArrayDeclaration
main/components/Commons/PagedProfitsTable.js:53:9
     }
 
     const columns = 
-        [
-            {
-                Header: "Profit",
-                accessor: "amount",
-                Cell: ({value}) => `$${value.toFixed(2)}`,
-            },
-            {
-                Header: "Date",
-                accessor: "timestamp",
-                Cell: ({ value }) => timestampToDate(value),
-            },
-            {
-                Header: "Health",
-                accessor: "avgCowHealth",
-                Cell: ({value}) => `${value.toFixed(2) + '%'}`
-            },
-            {
-                Header: "Cows",
-                accessor: "numCows",
-            },
-        ];
+        [];
 
 
killedBy: PagedProfitsTable tests renders correct content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Profit. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <p>
      Page: 
      1
    </p>

[Killed] ArrowFunction
main/components/Commons/PagedProfitsTable.js:67:23
             {
                 Header: "Health",
                 accessor: "avgCowHealth",
-                Cell: ({value}) => `${value.toFixed(2) + '%'}`
+                Cell: () => undefined
             },
             {
killedBy: PagedProfitsTable tests renders correct content
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Commons/PagedProfitsTable.js:67:58
             {
                 Header: "Health",
                 accessor: "avgCowHealth",
-                Cell: ({value}) => `${value.toFixed(2) + '%'}`
+                Cell: ({value}) => `${value.toFixed(2) + ""}`
             },
             {
killedBy: PagedProfitsTable tests renders correct content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  100.00%
Received:
  100.00

[Killed] ArrowFunction
main/components/Commons/PagedProfitsTable.js:77:9
 
 
     const sortees = React.useMemo(
-        () => [
-            {
-                id: "timestamp",
-                desc: true
-            }
-        ],
+        () => undefined,
         // Stryker disable next-line all
         []
killedBy: PlayPage tests click buy button
statusReason: TypeError: Cannot read properties of undefined (reading 'find')

[Killed] StringLiteral
main/components/Commons/PagedProfitsTable.js:79:21
     const sortees = React.useMemo(
         () => [
             {
-                id: "timestamp",
+                id: "",
                 desc: true
             }
killedBy: PagedProfitsTable tests renders correct content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  🔽
Received:

[Killed] BooleanLiteral
main/components/Commons/PagedProfitsTable.js:80:23
         () => [
             {
                 id: "timestamp",
-                desc: true
+                desc: false
             }
         ],
killedBy: PagedProfitsTable tests renders correct content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  🔽
Received:
  🔼

[Killed] ConditionalExpression
main/components/Commons/PagedProfitsTable.js:92:98
         <>
             <p>Page: {selectedPage + 1}</p>
             <Button data-testid={`${testId}-previous-button`}onClick={previousPageCallback()} disabled={ selectedPage === 0}>Previous</Button>
-            <Button data-testid={`${testId}-next-button`} onClick={nextPageCallback()} disabled={page.totalPages===0 || selectedPage === page.totalPages-1}>Next</Button>
+            <Button data-testid={`${testId}-next-button`} onClick={nextPageCallback()} disabled={true}>Next</Button>
             < OurTable
                 data={page.content}
killedBy: PagedProfitsTable tests renders correct content with multiple pages
statusReason: Error: expect(element).toBeEnabled()

Received element is not enabled:
  <button class="btn btn-primary" data-testid="PagedProfitsTable-next-button" disabled="" type="button" />

[Killed] LogicalOperator
main/components/Commons/PagedProfitsTable.js:92:98
         <>
             <p>Page: {selectedPage + 1}</p>
             <Button data-testid={`${testId}-previous-button`}onClick={previousPageCallback()} disabled={ selectedPage === 0}>Previous</Button>
-            <Button data-testid={`${testId}-next-button`} onClick={nextPageCallback()} disabled={page.totalPages===0 || selectedPage === page.totalPages-1}>Next</Button>
+            <Button data-testid={`${testId}-next-button`} onClick={nextPageCallback()} disabled={page.totalPages === 0 && selectedPage === page.totalPages - 1}>Next</Button>
             < OurTable
                 data={page.content}
killedBy: PagedProfitsTable tests renders correct content
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button class="btn btn-primary" data-testid="PagedProfitsTable-next-button" type="button" />
