[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.js:19:9
                 return <Link to={url}>{row.username}</Link>;
             },
         },
-        {
-            Header: "Total Wealth",
-           
-            id: "totalWealth",
-            accessor: (row, _rowIndex) => {
-                return row.totalWealth;
-            },
-
-            Cell: (props) => {
-                 return <div style={{ textAlign: "right" }}>{USD.format(props.value)}</div>;
-            },
-        },
+        {},
         {
             Header: "Cows Owned",
killedBy: LeaderboardTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.js:22:17
         {
             Header: "Total Wealth",
            
-            id: "totalWealth",
+            id: "",
             accessor: (row, _rowIndex) => {
                 return row.totalWealth;
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="LeaderboardTable-cell-row-0-col-totalWealth"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] BlockStatement
main/components/Leaderboard/LeaderboardTable.js:23:43
             Header: "Total Wealth",
            
             id: "totalWealth",
-            accessor: (row, _rowIndex) => {
-                return row.totalWealth;
-            },
+            accessor: (row, _rowIndex) => {},
 
             Cell: (props) => {
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $1,000.00
Received:
  $NaN

[Killed] BlockStatement
main/components/Leaderboard/LeaderboardTable.js:27:30
                 return row.totalWealth;
             },
 
-            Cell: (props) => {
-                 return <div style={{ textAlign: "right" }}>{USD.format(props.value)}</div>;
-            },
+            Cell: (props) => {},
         },
         {
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.js:28:37
             },
 
             Cell: (props) => {
-                 return <div style={{ textAlign: "right" }}>{USD.format(props.value)}</div>;
+                 return <div style={{}}>{USD.format(props.value)}</div>;
             },
         },
killedBy: LeaderboardTable tests Total wealth is formatted correctly
statusReason: Error: expect(element).toHaveStyle()

- Expected

- text-align: right;

[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.js:59:9
                 return <div style={{ textAlign: "right" }}>{props.value}</div>;
             },
         },
-        {
-            Header: "Cow Deaths",
-            accessor: "cowDeaths",
-            Cell: (props) => {
-                return <div style={{ textAlign: "right" }}>{props.value}</div>;
-            },
-        },
+        {},
     ];
 
killedBy: LeaderboardTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.js:68:20
         },
     ];
 
-    const testid = "LeaderboardTable";
+    const testid = "";
 
     return (
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="LeaderboardTable-cell-row-0-col-Farmer"]

<body>
  <div>
    <div
      role="table"
    >
      <table
