[Killed] StringLiteral
main/components/Courses/CoursesForm.js:67:42
                             id="term"
                             type="text"
                             isInvalid={Boolean(errors.term)}
-                            {...register("term", { required: true })}
+                            {...register("", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
