[Killed] StringLiteral
main/components/Courses/CoursesTable.js:48:44
      ];
 
      if (hasRole(currentUser, "ROLE_ADMIN")) {
-         columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
+         columns.push(ButtonColumn("Edit", "", editCallback, "CoursesTable"));
          columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
      }
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn
