[Killed] ArrowFunction
src/main/pages/CoursesCreatePage.js:9:33
 
 export default function CoursesCreatePage({storybook=false}) {
 
-    const objectToAxiosParams = (course) => ({
-        url: "/api/courses/post",
-        method: "POST",
-        params: {
-        name: course.name,
-        term: course.term
-        }
-    });
+    const objectToAxiosParams = () => undefined;
 
     const onSuccess = (course) => {
killedBy: CourseCreatePage tests on submit, makes request to backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/CoursesCreatePage.js:12:17
     const objectToAxiosParams = (course) => ({
         url: "/api/courses/post",
         method: "POST",
-        params: {
-        name: course.name,
-        term: course.term
-        }
+        params: {}
     });
 
killedBy: CourseCreatePage tests on submit, makes request to backend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "name": "CS156",
-   "term": "F23",
