[Killed] LogicalOperator
src/main/pages/CoursesIndexPage.js:37:12
     return (
       <BasicLayout>
         <div className="pt-2">
-          {(hasRole(currentUser, "ROLE_ADMIN")) && createButton()}
+          {hasRole(currentUser, "ROLE_ADMIN") || createButton()}
           <h1>Course</h1>
           <CoursesTable courses={courses} currentUser={currentUser} />
killedBy: CoursesIndexPage tests Renders with Create Button for admin user
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Create Course/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
src/main/pages/CoursesIndexPage.js:37:12
     return (
       <BasicLayout>
         <div className="pt-2">
-          {(hasRole(currentUser, "ROLE_ADMIN")) && createButton()}
+          {true}
           <h1>Course</h1>
           <CoursesTable courses={courses} currentUser={currentUser} />
killedBy: CoursesIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Course/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
