[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.js:55:15
       accessor: 'startDate',
     },
     {
-      Header: 'End Date ISO Format',
+      Header: "",
       accessor: 'endDate',
     },
killedBy: AnnouncementTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: End Date ISO Format. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] ObjectLiteral
main/components/Announcement/AnnouncementTable.js:58:5
       Header: 'End Date ISO Format',
       accessor: 'endDate',
     },
-    {
-      Header: 'Announcement',
-      accessor: 'announcementText',
-    },
+    {},
   ];
 
killedBy: AnnouncementTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementTable.js:64:7
     },
   ];
 
-  if (hasRole(currentUser, 'ROLE_ADMIN')) {
+  if (true) {
     columns.push(
       ButtonColumn('Edit', 'primary', editCallback, 'AnnouncementTable')
killedBy: AnnouncementTable tests Has the expected column headers, content for ordinary user
statusReason: TestingLibraryElementError: Found multiple elements with the text: Delete

Here are the matching elements:

<th
  colspan="1"
  data-testid="AnnouncementTable-header-Delete"
  role="columnheader"

[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.js:66:53
 
   if (hasRole(currentUser, 'ROLE_ADMIN')) {
     columns.push(
-      ButtonColumn('Edit', 'primary', editCallback, 'AnnouncementTable')
+      ButtonColumn('Edit', 'primary', editCallback, "")
     );
     columns.push(
killedBy: AnnouncementTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="AnnouncementTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] StringLiteral
main/components/Announcement/AnnouncementTable.js:69:20
       ButtonColumn('Edit', 'primary', editCallback, 'AnnouncementTable')
     );
     columns.push(
-      ButtonColumn('Delete', 'danger', deleteCallback, 'AnnouncementTable')
+      ButtonColumn("", 'danger', deleteCallback, 'AnnouncementTable')
     );
   }
killedBy: AnnouncementTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Announcement/AnnouncementTable.js:89:20
         <Button
           variant="secondary"
           data-testid="AnnouncementTable-Modal-Cancel"
-          onClick={() => setShowModal(false)}
+          onClick={() => undefined}
         >
           Keep this Announcement
killedBy: Modal tests Clicking Keep this Announcement button cancels the deletion
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] BooleanLiteral
main/components/Announcement/AnnouncementTable.js:89:39
         <Button
           variant="secondary"
           data-testid="AnnouncementTable-Modal-Cancel"
-          onClick={() => setShowModal(false)}
+          onClick={() => setShowModal(true)}
         >
           Keep this Announcement
killedBy: Modal tests Clicking Keep this Announcement button cancels the deletion
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] ArrowFunction
main/components/Announcement/AnnouncementTable.js:96:20
         <Button
           variant="danger"
           data-testid="AnnouncementTable-Modal-Delete"
-          onClick={() => confirmDelete(cellToDelete)}
+          onClick={() => undefined}
         >
           Permanently Delete
killedBy: Modal tests Clicking Permanently Delete button deletes the announcement
statusReason: Error: expect(element).not.toHaveClass("modal-open")

Expected the element not to have class:
  modal-open
Received:
  modal-open

<html>

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementTable.js:111:8
         columns={columns}
         testid={'AnnouncementTable'}
       />
-      {hasRole(currentUser, 'ROLE_ADMIN') && announcementsModal}
+      {false}
     </>
   );
killedBy: Modal tests Clicking Delete button opens the modal for adminUser
statusReason: Error: expect(element).toHaveClass("modal-open")

Expected the element to have class:
  modal-open
Received:


<html>

[Killed] ConditionalExpression
main/components/Announcement/AnnouncementTable.js:111:8
         columns={columns}
         testid={'AnnouncementTable'}
       />
-      {hasRole(currentUser, 'ROLE_ADMIN') && announcementsModal}
+      {true}
     </>
   );
killedBy: Modal tests Clicking Delete button opens the modal for adminUser
statusReason: Error: expect(element).toHaveClass("modal-open")

Expected the element to have class:
  modal-open
Received:


<html>
