[Killed] BlockStatement
src/main/utils/announcementUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: `/api/announcements/delete/${cell.row.values.id}`,
-    method: 'DELETE',
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: AnnouncementUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "DELETE", "url": "/api/announcements/delete/1"}
Received: undefined

[Killed] ObjectLiteral
src/main/utils/announcementUtils.js:9:10
 }
 
 export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: `/api/announcements/delete/${cell.row.values.id}`,
-    method: 'DELETE',
-  };
+  return {};
 }
 
killedBy: AnnouncementUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "method": "DELETE",
-   "url": "/api/announcements/delete/1",

[Killed] StringLiteral
src/main/utils/announcementUtils.js:11:13
 export function cellToAxiosParamsDelete(cell) {
   return {
     url: `/api/announcements/delete/${cell.row.values.id}`,
-    method: 'DELETE',
+    method: "",
   };
 }
killedBy: AnnouncementUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "method": "DELETE",
+   "method": "",
