[Killed] MethodExpression
src/main/components/OurTable.js:62:18
                 ))}
             </thead>
             <tbody {...getTableBodyProps()}>
-                {rows.slice(pageIndex * pageSize, (pageIndex + 1) * pageSize).map(row => {
+                {rows.map(row => {
                     prepareRow(row)
                     return (
killedBy: OurTable tests renders a table with 30 rows and clicks on the next page button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/main/components/OurTable.js:62:51
                 ))}
             </thead>
             <tbody {...getTableBodyProps()}>
-                {rows.slice(pageIndex * pageSize, (pageIndex + 1) * pageSize).map(row => {
+                {rows.slice(pageIndex * pageSize, (pageIndex + 1) / pageSize).map(row => {
                     prepareRow(row)
                     return (
killedBy: OurTable tests The button appears in the table
statusReason: Error: Unable to find an element by: [data-testid="testId-cell-row-0-col-Click-button"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] EqualityOperator
src/main/components/OurTable.js:81:10
                 })}
             </tbody>
         </Table>
-        {rows.length > pageSize && (<div style={paginationStyle}>
+        {rows.length >= pageSize && (<div style={paginationStyle}>
             <Pagination {...getTableProps()}>
                 <Pagination.Prev
killedBy: OurTable tests renders a table with 10 rows and tests that pagination isn't visible when there are less rows than rows per page
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/main/components/OurTable.js:81:10
                 })}
             </tbody>
         </Table>
-        {rows.length > pageSize && (<div style={paginationStyle}>
+        {rows.length <= pageSize && (<div style={paginationStyle}>
             <Pagination {...getTableProps()}>
                 <Pagination.Prev
killedBy: OurTable tests pagination isn't visible when there is no data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/main/components/OurTable.js:88:18
                     data-testid={`${testid}-prev-page-button`}
                     disabled={pageIndex === 0}
                 />
-                {pageIndex > 3 && (<Pagination.Item
-                    onClick={() => setPageIndex(0)}
-                    data-testid={`${testid}-first-page-button`}
-                >
-                    {1}
-                </Pagination.Item>)}
+                {false}
                 {pageIndex > 4 && (<Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />)}
                 {pageIndex === 4 && (<Pagination.Item
killedBy: OurTable tests renders a table with 60 rows and tests the first page
statusReason: Error: Unable to find an element by: [data-testid="testid-first-page-button"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] LogicalOperator
src/main/components/OurTable.js:88:18
                     data-testid={`${testid}-prev-page-button`}
                     disabled={pageIndex === 0}
                 />
-                {pageIndex > 3 && (<Pagination.Item
-                    onClick={() => setPageIndex(0)}
-                    data-testid={`${testid}-first-page-button`}
-                >
-                    {1}
-                </Pagination.Item>)}
+                {pageIndex > 3 || <Pagination.Item onClick={() => setPageIndex(0)} data-testid={`${testid}-first-page-button`}>
+                    {1}
+                </Pagination.Item>}
                 {pageIndex > 4 && (<Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />)}
                 {pageIndex === 4 && (<Pagination.Item
killedBy: OurTable tests renders a table with 60 rows and tests the first page
statusReason: Error: Unable to find an element by: [data-testid="testid-first-page-button"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] ArrowFunction
src/main/components/OurTable.js:89:30
                     disabled={pageIndex === 0}
                 />
                 {pageIndex > 3 && (<Pagination.Item
-                    onClick={() => setPageIndex(0)}
+                    onClick={() => undefined}
                     data-testid={`${testid}-first-page-button`}
                 >
killedBy: OurTable tests renders a table with 60 rows and tests the first page
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/main/components/OurTable.js:94:18
                 >
                     {1}
                 </Pagination.Item>)}
-                {pageIndex > 4 && (<Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />)}
+                {pageIndex <= 4 && (<Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />)}
                 {pageIndex === 4 && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex - 3)}
killedBy: OurTable tests renders a table with 60 rows and tests the last page button
statusReason: Error: Unable to find an element by: [data-testid="testid-left-ellipsis"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] LogicalOperator
src/main/components/OurTable.js:94:18
                 >
                     {1}
                 </Pagination.Item>)}
-                {pageIndex > 4 && (<Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />)}
+                {pageIndex > 4 || <Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />}
                 {pageIndex === 4 && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex - 3)}
killedBy: OurTable tests renders a table with 60 rows and tests the last page button
statusReason: Error: Unable to find an element by: [data-testid="testid-left-ellipsis"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] EqualityOperator
src/main/components/OurTable.js:95:18
                     {1}
                 </Pagination.Item>)}
                 {pageIndex > 4 && (<Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />)}
-                {pageIndex === 4 && (<Pagination.Item
+                {pageIndex !== 4 && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex - 3)}
                     data-testid={`${testid}-back-three-page-button`}
killedBy: OurTable tests renders a table with 60 rows and tests the first page
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/main/components/OurTable.js:95:18
                     {1}
                 </Pagination.Item>)}
                 {pageIndex > 4 && (<Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />)}
-                {pageIndex === 4 && (<Pagination.Item
-                    onClick={() => setPageIndex(pageIndex - 3)}
-                    data-testid={`${testid}-back-three-page-button`}
-                >
-                    {pageIndex - 2}
-                </Pagination.Item>)}
+                {true}
                 {pageIndex > 1 && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex - 2)}
killedBy: OurTable tests renders a table with 50 rows and moving back three pages
statusReason: Error: Unable to find an element by: [data-testid="testid-back-three-page-button"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] ArithmeticOperator
src/main/components/OurTable.js:96:49
                 </Pagination.Item>)}
                 {pageIndex > 4 && (<Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />)}
                 {pageIndex === 4 && (<Pagination.Item
-                    onClick={() => setPageIndex(pageIndex - 3)}
+                    onClick={() => setPageIndex(pageIndex + 3)}
                     data-testid={`${testid}-back-three-page-button`}
                 >
killedBy: OurTable tests renders a table with 50 rows and moving back three pages
statusReason: Error: expect(element).toContainHTML()
Expected:
  2
Received:
  <span class="page-link" data-testid="testid-current-page-button">8<span class="visually-hidden">(current)</span></span>

[Killed] ArrowFunction
src/main/components/OurTable.js:96:30
                 </Pagination.Item>)}
                 {pageIndex > 4 && (<Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />)}
                 {pageIndex === 4 && (<Pagination.Item
-                    onClick={() => setPageIndex(pageIndex - 3)}
+                    onClick={() => undefined}
                     data-testid={`${testid}-back-three-page-button`}
                 >
killedBy: OurTable tests renders a table with 50 rows and moving back three pages
statusReason: Error: expect(element).toContainHTML()
Expected:
  2
Received:
  <span class="page-link" data-testid="testid-current-page-button">5<span class="visually-hidden">(current)</span></span>

[Killed] StringLiteral
src/main/components/OurTable.js:97:34
                 {pageIndex > 4 && (<Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />)}
                 {pageIndex === 4 && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex - 3)}
-                    data-testid={`${testid}-back-three-page-button`}
+                    data-testid={``}
                 >
                     {pageIndex - 2}
killedBy: OurTable tests renders a table with 50 rows and moving back three pages
statusReason: Error: Unable to find an element by: [data-testid="testid-back-three-page-button"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] EqualityOperator
src/main/components/OurTable.js:101:18
                 >
                     {pageIndex - 2}
                 </Pagination.Item>)}
-                {pageIndex > 1 && (<Pagination.Item
+                {pageIndex <= 1 && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex - 2)}
                     data-testid={`${testid}-back-two-page-button`}
killedBy: OurTable tests renders a table with 60 rows and tests the first page
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/main/components/OurTable.js:101:18
                 >
                     {pageIndex - 2}
                 </Pagination.Item>)}
-                {pageIndex > 1 && (<Pagination.Item
-                    onClick={() => setPageIndex(pageIndex - 2)}
-                    data-testid={`${testid}-back-two-page-button`}
-                >
-                    {pageIndex - 1}
-                </Pagination.Item>)}
+                {false}
                 {pageIndex > 0 && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex - 1)}
killedBy: OurTable tests renders a table with 60 rows and tests the last page button
statusReason: Error: Unable to find an element by: [data-testid="testid-back-two-page-button"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] ArithmeticOperator
src/main/components/OurTable.js:102:49
                     {pageIndex - 2}
                 </Pagination.Item>)}
                 {pageIndex > 1 && (<Pagination.Item
-                    onClick={() => setPageIndex(pageIndex - 2)}
+                    onClick={() => setPageIndex(pageIndex + 2)}
                     data-testid={`${testid}-back-two-page-button`}
                 >
killedBy: OurTable tests renders a table with 100 rows and tests moving back two pages
statusReason: Error: expect(element).toContainHTML()
Expected:
  3
Received:
  <span class="page-link" data-testid="testid-current-page-button">7<span class="visually-hidden">(current)</span></span>

[Killed] ArrowFunction
src/main/components/OurTable.js:102:30
                     {pageIndex - 2}
                 </Pagination.Item>)}
                 {pageIndex > 1 && (<Pagination.Item
-                    onClick={() => setPageIndex(pageIndex - 2)}
+                    onClick={() => undefined}
                     data-testid={`${testid}-back-two-page-button`}
                 >
killedBy: OurTable tests renders a table with 100 rows and tests moving back two pages
statusReason: Error: expect(element).toContainHTML()
Expected:
  3
Received:
  <span class="page-link" data-testid="testid-current-page-button">5<span class="visually-hidden">(current)</span></span>

[Killed] ConditionalExpression
src/main/components/OurTable.js:107:18
                 >
                     {pageIndex - 1}
                 </Pagination.Item>)}
-                {pageIndex > 0 && (<Pagination.Item
-                    onClick={() => setPageIndex(pageIndex - 1)}
-                    data-testid={`${testid}-back-one-page-button`}
-                >
-                    {pageIndex}
-                </Pagination.Item>)}
+                {false}
                 <Pagination.Item
                     data-testid={`${testid}-current-page-button`}
killedBy: OurTable tests renders a table with 60 rows and tests the last page button
statusReason: Error: Unable to find an element by: [data-testid="testid-back-one-page-button"]

<body>
  <div>
    <div
      role="table"
    >
      <table

[Killed] EqualityOperator
src/main/components/OurTable.js:107:18
                 >
                     {pageIndex - 1}
                 </Pagination.Item>)}
-                {pageIndex > 0 && (<Pagination.Item
+                {pageIndex >= 0 && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex - 1)}
                     data-testid={`${testid}-back-one-page-button`}
killedBy: OurTable tests renders a table with 60 rows and tests the first page
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
src/main/components/OurTable.js:108:30
                     {pageIndex - 1}
                 </Pagination.Item>)}
                 {pageIndex > 0 && (<Pagination.Item
-                    onClick={() => setPageIndex(pageIndex - 1)}
+                    onClick={() => undefined}
                     data-testid={`${testid}-back-one-page-button`}
                 >
killedBy: OurTable tests renders a table with 50 rows and tests moving forward one and two pages
statusReason: Error: expect(element).toContainHTML()
Expected:
  2
Received:
  <span class="page-link" data-testid="testid-current-page-button">5<span class="visually-hidden">(current)</span></span>

[Killed] ArithmeticOperator
src/main/components/OurTable.js:108:49
                     {pageIndex - 1}
                 </Pagination.Item>)}
                 {pageIndex > 0 && (<Pagination.Item
-                    onClick={() => setPageIndex(pageIndex - 1)}
+                    onClick={() => setPageIndex(pageIndex + 1)}
                     data-testid={`${testid}-back-one-page-button`}
                 >
killedBy: OurTable tests renders a table with 50 rows and tests moving forward one and two pages
statusReason: Error: expect(element).toContainHTML()
Expected:
  2
Received:
  <span class="page-link" data-testid="testid-current-page-button">8<span class="visually-hidden">(current)</span></span>

[Killed] StringLiteral
src/main/components/OurTable.js:109:34
                 </Pagination.Item>)}
                 {pageIndex > 0 && (<Pagination.Item
                     onClick={() => setPageIndex(pageIndex - 1)}
-                    data-testid={`${testid}-back-one-page-button`}
+                    data-testid={``}
                 >
                     {pageIndex}
killedBy: OurTable tests renders a table with 60 rows and tests the last page button
statusReason: Error: Unable to find an element by: [data-testid="testid-back-one-page-button"]

<body>
  <div>
    <div
      role="table"
    >
      <table
